tap "anomalyco/tap"
tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "shivammathur/php"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Download with resuming and segmented downloading
brew "aria2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Official Amazon AWS command-line interface
brew "awscli"
# Core application library for C
brew "glib"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Lightning-fast linter for .env files written in Rust
brew "dotenv-linter"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Next-gen compiler infrastructure
brew "llvm"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql@8.0"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk@11"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Password manager
brew "pass"
# Port of pdftk in java
brew "pdftk-java"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Password generator
brew "pwgen"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Intelligent cloud storage platform
cask "adrive"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Application uninstaller
cask "appcleaner"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Server and cloud storage browser
cask "cyberduck"
# Client for the Dropbox cloud storage service
cask "dropbox"
# App for note taking, organising, task lists, and archiving
cask "evernote"
# Web browser
cask "firefox"
cask "font-input"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-moralerspace"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "font-symbols-only-nerd-font"
cask "font-udev-gothic-nf"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop automation application
cask "hammerspoon"
# Free and open-source media player
cask "iina"
# File archiver
cask "keka"
# GPU-based terminal emulator
cask "kitty"
# Customise mouse behavior
cask "linearmouse"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop virtualization software
cask "parallels"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Instant messaging tool
cask "qq"
# Open source virtual/remote desktop application
cask "rustdesk"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Keyboard configurator
cask "via"
# Video communication and virtual meeting platform
cask "zoom"
uv "claude-monitor"
npm "@colbymchenry/codegraph"
npm "@mermaid-js/mermaid-cli"
npm "ccstatusline"
npm "ccusage"
npm "corepack"
npm "hunkdiff"
npm "uipro-cli"
