tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "openssl@3"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "git-crypt"
brew "git-delta"
brew "hub"
brew "jq"
brew "lazygit"
brew "llvm"
brew "mycli"
brew "mysql"
brew "neovim"
brew "pdftk-java"
brew "rbenv"
brew "ripgrep"
brew "tmux"
brew "zsh-autocomplete"
brew "koekeishiya/formulae/yabai"
cask "appcleaner"
cask "coteditor"
cask "dropbox"
cask "evernote"
cask "font-input"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "font-symbols-only-nerd-font"
cask "hammerspoon"
cask "keka"
cask "kitty"
cask "linearmouse"
cask "monitorcontrol"
cask "stats"
