tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "shivammathur/php"
brew "openssl@3"
brew "aria2"
brew "python@3.12"
brew "glib"
brew "php"
brew "composer"
brew "dotenv-linter"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-crypt"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "harfbuzz"
brew "htop"
brew "hub"
brew "jq"
brew "lazygit"
brew "llvm"
brew "mycli"
brew "mysql@8.0"
brew "neovim"
brew "openjdk@11"
brew "pass"
brew "pdftk-java"
brew "pwgen"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "tmux"
brew "wget"
brew "zsh-autocomplete"
brew "koekeishiya/formulae/yabai"
brew "shivammathur/php/php@7.3"
cask "adrive"
cask "appcleaner"
cask "coteditor"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "font-input"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"
cask "font-symbols-only-nerd-font"
cask "gimp"
cask "hammerspoon"
cask "iina"
cask "keka"
cask "kitty"
cask "linearmouse"
cask "monitorcontrol"
cask "parallels"
cask "qq"
cask "rustdesk"
cask "stats"
cask "telegram"
cask "telegram-desktop"
cask "zoom"
